#include "qdr_stack.h"

//=================================================================================
// stack_init
//=================================================================================
void stack_init(struct LRStack *s)
{
	memset(s, 0, sizeof(struct LRStack));
}

//=================================================================================
// stack_empty
//=================================================================================
int stack_empty(struct LRStack *s)
{
	return !s ? 1 : s->count ? 0 : 1;
}

//=================================================================================
// stack_pop
//=================================================================================
void stack_pop(struct LRStack *s)
{
	if(!s)
		return;
	if(s->count <= 0)
		return;
	
	//stack_topで参照している場合もあるので、クリアしない
	//memset(&s->r[s->count-1], 0, sizeof(struct Rectangle));
	s->count--;
}

//=================================================================================
// stack_push
//=================================================================================
void stack_push(struct LRStack *s, struct Rectangle *r)
{
	if(!s)
		return;
	if(!r)
		return;
	if(s->count >= QDR_MAXMSIZE)
		return;
	
	memcpy(&s->r[s->count], r, sizeof(struct Rectangle));
	s->count++;
}

//=================================================================================
// stack_top
//=================================================================================
struct Rectangle *stack_top(struct LRStack *s)
{
	if(!s)
		return NULL;
	if(s->count <= 0)
		return NULL;
	
	return &s->r[s->count-1];
}

//=================================================================================
// stack_size
//=================================================================================
int stack_size(struct LRStack *s)
{
	return s ? s->count : 0;
}

//=================================================================================
// stack_dump
//=================================================================================
void stack_dump(struct LRStack *s)
{
	int i;
	for(i=0; i<s->count; i++)
		printf("[%d] %d %d\n", i, s->r[i].pos, s->r[i].height);
}

